[
    {
        "Ques": "What was alleged in this case?",
        "Ans": "The appellant –‘Vimal Organics Limited’ reached an agreement with respondent – ‘M/s. Anya Polytech and Fertilizers Pvt. Ltd.’ (Corporate Debtor) on 3rd May, 2014 for supply of Buyer Zinc Sulphate Manufacturing Plant (50MTPD) complete with machinery. It was alleged that the Corporate Debtor did not pay any amount for the invoices raised by the Operational Creditor against the Corporate Debtor.",
        "link": "https://nclat.nic.in/Useradmin/upload/14131774075b72adc820332.pdf" 
    },
    {
        "Ques": "What did the Adjudicating Authority hold?",
        "Ans": "After demand notice issued under sub-section (1) of Section 8 of the Insolvency and Bankruptcy Code, 2016 (hereinafter referred to as the ‘I&B Code’), the respondent having not paid the amount, the Operational Creditor preferred an application under Section 9 I & B Code, which has been rejected by the Adjudicating Authority (National Company Law Tribunal) New Delhi by the impugned order dated 10th October, 2017 in case No. (IB)-370(ND)/2017",
        "link": "https://nclat.nic.in/Useradmin/upload/14131774075b72adc820332.pdf" 
    },
    {
        "Ques": "What was held in this case?",
        "Ans": "In the present case as we find that there is an ‘existence of dispute’, we hold that the Adjudicating Authority rightly dismissed the application preferred by the appellants under Section 9 of the I & B Code. In absence of any merit, the appeal is dismissed. No cost. [Justice",
        "link": "https://nclat.nic.in/Useradmin/upload/14131774075b72adc820332.pdf" 
    },
    {
        "Ques": "What was observed in this case?",
        "Ans": "There is nothing on record to show that the defects were removed thereafter. For the said reason, in reply to the demand notice issued by Operational Creditor under sub-section (1) of Section 8 the Corporate Debtor by reply dated 20th July, 2017 brought the aforesaid facts to the notice of the Operational Creditor.",
        "link": "https://nclat.nic.in/Useradmin/upload/14131774075b72adc820332.pdf" 
    },
    {
        "Ques": "What is the appeal about?",
        "Ans": "The case of the Appellant(s) is that the ‘Corporate Debtor’ having failed to pay the debt amount, ‘Financial Creditor’ initiated notice under sub Section (2) of Section 3 of SARFAESI Act, 2002 demanding payment of Rs. 8,92,68,513.80 (Rupees Eight Crores, Ninety-two Lakhs, Sixty-eight Thousand Five Hundred Thirteen and paise Eighty only) within 60 days. ",
        "link": "https://nclat.nic.in/Useradmin/upload/8261432485b72ae4e434d3.pdf" 
    },
    {
        "Ques": "What did the Adjudicating Authority hold?",
        "Ans": " by the Adjudicating Authority (National Company Law Tribunal, Kolkata Bench, Kolkata) whereby and whereunder the application preferred by Respondent- Punjab National Bank (Operational Creditor) under Section 7 of the Insolvency & Bankruptcy Code, 2016 (hereinafter referred to as I&B Code) r/w Rule 4 of Insolvency and Bankruptcy Code, (Application to Adjudicating Authority) Rules, 2016, has been admitted, order of Moratorium has been passed, Interim Resolution Professional has been appointed with directions as mentioned therein. ",
        "link": "https://nclat.nic.in/Useradmin/upload/8261432485b72ae4e434d3.pdf" 
    },
    {
        "Ques": "What washeld in Innovative Industries Ltd. Vs. ICICI Bank",
        "Ans": "n “Innovative Industries Ltd. Vs. ICICI Bank” – 2017 SCC online SC 1025. In the said case, the Hon’ble Supreme Court held: 1. “28. When it comes to a financial creditor triggering the process, Section 7 becomes relevant. Under the explanation to Section 7(1), a default is in respect of a financial debt owed to any financial creditor of the corporate debtor - it need not be a debt owed to the applicant financial creditor. Under Section 7(2), an application is to be made under sub-section (1) in such form and manner as is prescribed, which takes us to the Insolvency and Bankruptcy (Application to Adjudicating Authority) Rules, 2016. Under Rule 4, the application is made by a financial creditor in Form 1 accompanied by documents and records required therein. Form 1 is a detailed form in 5 parts, which requires particulars of the applicant in Part I, particulars of the corporate debtor in Part II, particulars of the proposed interim resolution professional in part COMPANY APPEAL (AT)(INSOLVENCY) NO. 237 OF 2017 5 III, particulars of the financial debt in part IV and documents, records and evidence of default in part V. Under Rule 4(3), the applicant is to dispatch a copy of the application filed with the adjudicating authority by registered post or speed post to the registered office of the corporate debtor. The speed, within which the adjudicating authority is to ascertain the existence of a default from the records of the information utility or on the basis of evidence furnished by the financial creditor, is important. This it must do within 14 days of the receipt of the application. It is at the stage of Section 7(5), where the adjudicating authority is to be satisfied that a default has occurred, that the corporate debtor is entitled to point out that a default has not occurred in the sense that the “debt”, which may also include a disputed claim, is not due. A debt may not be due if it is not payable in law or in fact. The moment the adjudicating authority is satisfied that a default has occurred, the application must be admitted unless it is incomplete, in which case it may give notice to the applicant to rectify the defect within 7 days of receipt of a notice from the adjudicating authority. Under sub-section (7), the adjudicating authority shall then communicate the order passed to the financial creditor and corporate debtor within 7 days of admission or rejection of such application, as the case may be",
        "link": "https://nclat.nic.in/Useradmin/upload/8261432485b72ae4e434d3.pdf" 
    },
    {
        "Ques": "What did the supreme cout hpld in Innovative Industries Ltd. Vs. ICICI Bank",
        "Ans": "On the other hand, as we have seen, in the case of a corporate debtor who commits a default of a financial debt, the adjudicating authority has merely to see the records of the information utility or other evidence produced by the financial creditor to satisfy itself that a default has occurred. It is of no matter that the debt is disputed so long as the debt is “due” i.e payable unless interdicted by some law or has not yet become due in the sense that it is payable at some future date. It is only when this is proved to the satisfaction of the adjudicating authority that the adjudicating authority may reject an application and not otherwise",
        "link": "https://nclat.nic.in/Useradmin/upload/8261432485b72ae4e434d3.pdf" 
    },
    {
        "Ques": "What did this court hold in this appeal",
        "Ans": "In the present case as we find that the Respondent on calculation of interest have shown the amount due and default taken place, such records placed before the Adjudicating Authority and record being complete if the application under Section 7 of the I & B Code has been entertained as admitted, no interference is called for. We find no merit in this appeal. It is COMPANY APPEAL (AT)(INSOLVENCY) NO. 237 OF 2017 7 accordingly dismissed. However, in the facts and circumstances of the case, there shall be no orders to cost.",
        "link": "https://nclat.nic.in/Useradmin/upload/8261432485b72ae4e434d3.pdf" 
    },  
    {
        "Ques": "when can no interference be called for in section 7?",
        "Ans": "calculation of interest have shown the amount due and default taken place, such records placed before the Adjudicating Authority and record being complete if the application under Section 7 of the I & B Code has been entertained as admitted, no interference is called for",
        "link": "https://nclat.nic.in/Useradmin/upload/8261432485b72ae4e434d3.pdf" 
    }
    
]